-- phpMyAdmin SQL Dump
-- version 4.3.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Feb 01, 2016 at 11:52 AM
-- Server version: 5.6.24
-- PHP Version: 5.6.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `final_project`
--

-- --------------------------------------------------------

--
-- Table structure for table `bus`
--

CREATE TABLE IF NOT EXISTS `bus` (
  `b_id` int(5) NOT NULL COMMENT 'รหัส',
  `b_name` varchar(255) DEFAULT NULL COMMENT 'ชื่อ'
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `bus`
--

INSERT INTO `bus` (`b_id`, `b_name`) VALUES
(1, 'บริษัท 407 พัฒนา'),
(2, 'บริษัท ชาญทัวร์ จำกัด'),
(36, 'บริษัท สมบัติทัวร์ จำกัด');

-- --------------------------------------------------------

--
-- Table structure for table `cost`
--

CREATE TABLE IF NOT EXISTS `cost` (
  `startstation_id` varchar(255) NOT NULL,
  `endstation_id` varchar(255) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `province_th`
--

CREATE TABLE IF NOT EXISTS `province_th` (
  `province_id` int(11) NOT NULL,
  `province_name` varchar(255) NOT NULL,
  `province_lat` varchar(255) NOT NULL,
  `province_lon` varchar(255) NOT NULL,
  `province_zoom` int(11) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=80 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `province_th`
--

INSERT INTO `province_th` (`province_id`, `province_name`, `province_lat`, `province_lon`, `province_zoom`) VALUES
(1, 'กรุงเทพมหานคร', '13.7278956', '100.52412349999997', 13),
(2, 'กระบี่', '8.0862997', '98.90628349999997', 13),
(3, 'กาญจนบุรี', '14.0227797', '99.53281149999998', 13),
(4, 'กาฬสินธุ์', '16.4314078', '103.5058755', 13),
(5, 'กำแพงเพชร', '16.4827798', '99.52266179999992', 13),
(6, 'ขอนแก่น', '16.4419355', '102.8359921', 13),
(7, 'จันทบุรี', '12.61134', '102.10385459999998', 13),
(8, 'ฉะเชิงเทรา', '13.6904194', '101.07795959999999', 13),
(9, 'ชลบุรี', '13.3611431', '100.98467170000004', 13),
(10, 'ชัยนาท', '15.1851971', '100.12512500000003', 13),
(11, 'ชัยภูมิ', '15.8068173', '102.03150270000003', 13),
(12, 'ชุมพร', '10.4930496', '99.18001989999993', 13),
(13, 'เชียงราย', '19.9071656', '99.83095500000002', 13),
(14, 'เชียงใหม่', '18.7877477', '98.99313110000003', 13),
(15, 'ตรัง', '7.5593851', '99.61100650000003', 13),
(16, 'ตราด', '12.2427563', '102.51747339999997', 13),
(17, 'ตาก', '16.8839901', '99.12584979999997', 13),
(18, 'นครนายก', '14.2069466', '101.21305110000003', 13),
(19, 'นครปฐม', '13.8199206', '100.06216760000007', 13),
(20, 'นครพนม', '17.392039', '104.76955079999993', 13),
(21, 'นคราชสีมา', '14.9798997', '102.09776929999998', 13),
(22, 'นครศรีธรรมราช', '8.4303975', '99.96312190000003', 13),
(23, 'นครสวรรค์', '15.6930072', '100.12255949999997', 13),
(24, 'นนทบุรี', '13.8621125', '100.51435279999998', 13),
(25, 'นราธิวาส', '6.4254607', '101.82531429999995', 13),
(26, 'น่าน', '18.7756318', '100.77304170000002', 13),
(27, 'บุรีรัมย์', '14.9930017', '103.10291910000001', 13),
(28, 'ปทุมธานี', '14.0208391', '100.52502759999993', 13),
(29, 'ประจวบคีรีขันธ์', '11.812367', '99.79732709999996', 13),
(30, 'ปราจีนบุรี', '14.0509704', '101.37274389999993', 13),
(31, 'ปัตตานี', '6.869484399999999', '101.25048259999994', 13),
(32, 'พระนครศรีอยุธยา', '14.3532128', '100.56895989999998', 13),
(33, 'พะเยา', '19.1664789', '99.9019419', 13),
(34, 'พังงา', '8.4407456', '98.51930319999997', 13),
(35, 'พัทลุง', '7.6166823', '100.07402309999998', 13),
(36, 'พิจิตร', '16.4429516', '100.34823289999997', 13),
(37, 'พิษณุโลก', '16.8298048', '100.26149150000003', 13),
(38, 'เพชรบุรี', '13.1111601', '99.93913069999996', 13),
(39, 'เพชรบูรณ์', '16.4189807', '101.15509259999999', 13),
(40, 'แพร่', '18.1445774', '100.14028310000003', 13),
(41, 'ภูเก็ต', '7.9810496', '98.36388239999997', 13),
(42, 'มหาสารคาม', '16.1850896', '103.30264609999995', 13),
(43, 'มุกดาหาร', '16.542443', '104.72091509999996', 13),
(44, 'แม่ฮ่องสอน', '19.2990643', '97.96562259999996', 13),
(45, 'ยโสธร', '15.792641', '104.14528270000005', 13),
(46, 'ยะลา', '6.541147', '101.28039469999999', 13),
(47, 'ร้อยเอ็ด', '16.0538196', '103.65200359999994', 13),
(48, 'ระนอง', '9.9528702', '98.60846409999999', 13),
(49, 'ระยอง', '12.6833115', '101.23742949999996', 13),
(50, 'ราชบุรี', '13.5282893', '99.81342110000003', 13),
(51, 'ลพบุรี', '14.7995081', '100.65337060000002', 13),
(52, 'ลำปาง', '18.2888404', '99.49087399999996', 13),
(53, 'ลำพูน', '18.5744606', '99.0087221', 13),
(54, 'เลย', '17.4860232', '101.72230020000006', 13),
(55, 'ศรีสะเกษ', '15.1186009', '104.32200949999992', 13),
(56, 'สกลนคร', '17.1545995', '104.1348365', 13),
(57, 'สงขลา', '7.1756004', '100.61434699999995', 13),
(58, 'สตูล', '6.6238158', '100.06737440000006', 13),
(59, 'สมุทรปราการ', '13.5990961', '100.59983190000003', 13),
(60, 'สมุทรสงคราม', '13.4098217', '100.00226450000002', 13),
(61, 'สมุทรสาคร', '13.5475216', '100.27439559999993', 13),
(62, 'สระแก้ว', '13.824038', '102.0645839', 13),
(63, 'สระบุรี', '14.5289154', '100.91014210000003', 13),
(64, 'สิงห์บุรี', '14.8936253', '100.39673140000002', 13),
(65, 'สุโขทัย', '17.0055573', '99.82637120000004', 13),
(66, 'สุพรรณบุรี', '14.4744892', '100.11771279999994', 13),
(67, 'สุราษฎร์ธานี', '9.1382389', '99.32174829999997', 13),
(68, 'สุรินทร์', '14.882905', '103.49371070000007', 13),
(69, 'หนองคาย', '17.8782803', '102.74126380000007', 13),
(70, 'หนองบัวลำภู', '17.2218247', '102.42603680000002', 13),
(71, 'อ่างทอง', '14.5896054', '100.45505200000002', 13),
(72, 'อำนาจเจริญ', '15.8656783', '104.62577740000006', 13),
(73, 'อุดรธานี', '17.4138413', '102.78723250000007', 13),
(74, 'อุตรดิตถ์', '17.6200886', '100.09929420000003', 13),
(75, 'อุทัยธานี', '15.3835001', '100.02455269999996', 13),
(76, 'อุบลราชธานี', '15.2286861', '104.85642170000006', 13),
(77, 'บึงกาฬ', '18.3609104', '103.64644629999998', 13),
(78, ' สถานีขนส่งผู้โดยสารจังหวัดขอนแก่น', '16.439651 ', '102.833439', 18),
(79, 'สถานีขนส่งผู้โดยสารจังหวัดขอนแก่น แห่งที่ 3(แห่งใหม่)', '16.389892 ', '102.804487', 13);

-- --------------------------------------------------------

--
-- Table structure for table `station`
--

CREATE TABLE IF NOT EXISTS `station` (
  `station_id` int(11) NOT NULL,
  `station_name` varchar(255) NOT NULL,
  `station_lat` varchar(255) NOT NULL,
  `station_lon` varchar(255) NOT NULL,
  `station_zoom` int(11) NOT NULL,
  `station_type` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `station`
--

INSERT INTO `station` (`station_id`, `station_name`, `station_lat`, `station_lon`, `station_zoom`, `station_type`) VALUES
(1, 'สถานีขนส่งผู้โดยสารขอนแก่น', '16.43960992290757', '102.8333098909851', 0, 'bus'),
(2, 'สถานีปรับอากาศผู้โดยสารจังหวัดขอนแก่น  ', '16.432877879063568', '102.83638333862302', 13, 'bus'),
(3, 'สถานีขนส่งผู้โดยสารจังหวัดขอนแก่น แห่งที่ 3(แห่งใหม่)', '16.389891540333977', '102.80450864911211', 0, 'bus'),
(4, 'สถานีขนส่งอำเภอกระนวน จังหวัดขอนแก่น', '16.714803', '103.116428', 0, 'bus'),
(5, 'สถานีขนส่งเขาสวนกวาง จังหวัดขอนแก่น', '', '', 0, 'bus'),
(6, 'สถานีขนส่งอำเภอชุมแพ จังหวัดขอนแก่น', '16.542465', '102.100400', 0, 'bus'),
(7, 'สถานีขนส่งต.โนนสะอาด จังหวัดขอนแก่น', '16.442416', '102.839760', 0, 'bus'),
(8, 'สถานีขนส่งอำเภอน้ำพอง จังหวัดขอนแก่น', '', '', 0, 'bus'),
(9, 'สถานีขนส่งผู้โดยสารอำเภอบ้านไผ่ ตำบล ในเมือง อำเภอ บ้านไผ่ ขอนแก่น', '16.057277 ', '102.726633', 0, 'bus'),
(10, 'สถานีขนส่งอำเภอเมืองพล จังหวัดขอนแก่น', '15.814079 ', '102.605831', 0, 'bus'),
(11, 'สถานีขนส่งอำเภอภูเวียง จังหวัดขอนแก่น', '16.639506', '102.417631', 0, 'bus'),
(12, 'สถานีขนส่งอำเภอหนองสองห้อง จังหวัดขอนแก่น', '', '', 0, 'bus'),
(13, 'สถานีขนส่งอำเภอภูเวียง จังหวัดขอนแก่น', '16.645996', '102.391503', 0, 'bus'),
(14, 'สถานีขนส่งผู้โดยสารเทศบาลจังหวัดหนองคาย แห่งที่ 1', '17.885369', '102.754684', 0, 'bus'),
(15, 'สถานีขนส่งอุดร', '17.404729', '102.799264', 0, 'bus'),
(16, 'สถานีขนส่งผู้โดยสารอุดรธานี2', '17.414471', '102.764723', 0, 'bus'),
(17, 'มหาวิทยาลัยขอนแก่น', '16.4642862', '102.82984290000002', 13, 'bus'),
(45, 'เซนทรัล ขอนแก่น', '16.432958', '102.824392', 0, 'van'),
(46, 'สถานีขนส่งผู้โดยสารอำเภอพล จังหวัดขอนแก่น ', '15.814079', '102.605831', 0, 'van'),
(47, 'สถานีขนส่งผู้โดยสารอำเภอบ้านไผ่ จังหวัดขอนแก่น ', '16.057218 ', '102.726682', 0, 'van'),
(48, 'สถานีขนส่งผู้โดยสารอำเภอชุมแพ จังหวัดขอนแก่น ', '16.542676', '102.097322', 0, 'van'),
(49, 'สถานีขนส่งผู้โดยสารอำเภอภูเขียว จังหวัดขอนแก่น ', '16.364215', '102.126848', 0, 'van'),
(50, 'สถานีขนส่งผู้โดยสารเทศบาลจังหวัดหนองคาย แห่งที่ 1', '17.885624 ', '102.754705', 0, 'van'),
(53, 'สถานีขนส่งพันดอน กุมภาวาปี จังหวัดอุดรธานี', '17.137756', '102.943178', 0, 'van'),
(54, 'เซ็นทรัลพลาซ่า จังหวัดอุดรธานี', '17.404794', '102.800300', 0, 'van'),
(55, 'มหาวิทยาลัยราชภัฏอุดรธานี', '17.397467', '102.794539', 0, 'van'),
(56, 'สถานีขนส่งผู้โดยสารจังหวัดขอนแก่น แห่งที่ 3 ', '16.389892 ', '102.804487', 13, 'bus'),
(57, 'มหาวิทยาลัยขอนแก่น\r\n(กังสดาล)', '16.4642862 	', '102.82984290000002', 13, 'van'),
(58, 'มหาวิทยาลัยขอนแก่น\r\n(สวนกัลปพฤกษ์)', '16.47819117266191', '102.82491836424867', 13, 'van\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `van`
--

CREATE TABLE IF NOT EXISTS `van` (
  `v_id` int(5) NOT NULL COMMENT 'รหัส',
  `v_name` varchar(60) NOT NULL COMMENT 'ชื่อ'
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `van`
--

INSERT INTO `van` (`v_id`, `v_name`) VALUES
(1, 'บริษัท ภูเขียว');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bus`
--
ALTER TABLE `bus`
  ADD PRIMARY KEY (`b_id`);

--
-- Indexes for table `province_th`
--
ALTER TABLE `province_th`
  ADD PRIMARY KEY (`province_id`);

--
-- Indexes for table `station`
--
ALTER TABLE `station`
  ADD PRIMARY KEY (`station_id`);

--
-- Indexes for table `van`
--
ALTER TABLE `van`
  ADD PRIMARY KEY (`v_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bus`
--
ALTER TABLE `bus`
  MODIFY `b_id` int(5) NOT NULL AUTO_INCREMENT COMMENT 'รหัส',AUTO_INCREMENT=37;
--
-- AUTO_INCREMENT for table `province_th`
--
ALTER TABLE `province_th`
  MODIFY `province_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=80;
--
-- AUTO_INCREMENT for table `station`
--
ALTER TABLE `station`
  MODIFY `station_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=59;
--
-- AUTO_INCREMENT for table `van`
--
ALTER TABLE `van`
  MODIFY `v_id` int(5) NOT NULL AUTO_INCREMENT COMMENT 'รหัส',AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
